app/controllers/bets_loader_controller.rb

    def api_test

      @coefficients_info = BookmakerCoefficients.all
---
SELECT `bookmaker_coefficients`.* FROM `bookmaker_coefficients`