app/controllers/password_resets_controller.rb

SELECT 1 FROM `users` WHERE (`users`.`email` = BINARY 'dxkxzx@gmail.com') AND (`users`.id <> 2) LIMIT 1
---
  def create
    user = User.find_by_email(params[:email])

SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'x0TsxAIfqdMomD+tjQ==' LIMIT 1
---
  def edit
    @user = User.find_by_password_reset_token!(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'VkibMshMMEYUUm7SRg==' LIMIT 1
UPDATE `users` SET `updated_at` = '2011-08-01 15:30:23', `encrypted_password` = '1f0490861c433c944d1b2e3dc37b4aa7069a9f978a988a09378f4f59646186e8' WHERE `users`.`id` = 2
---
  def update
    @user = User.find_by_password_reset_token!(params[:id])
    if @user.password_reset_sent_at < 2.hours.ago
      redirect_to new_password_reset_path, :alert => "Password reset has expired."
    elsif @user.update_attributes(params[:user])