app/controllers/users_controller.rb

  def index
    @users = User.all
    @users = User.order(:name).page params[:page]
---
SELECT `users`.* FROM `users` LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM `users`

  def show
    @user = User.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def create
    @user = User.create(params[:user])
---
INSERT INTO `users` (`salt`, `name`, `email`, `password_reset_sent_at`, `updated_at`, `created_at`, `password_reset_token`, `admin`, `encrypted_password`) VALUES ('209665723f0cb22cae213cb3db17c2e1c5d992443ce87c8e9fced2b5db60b7a2', 'vasya', 'dxkxzx@gmail.com', NULL, '2011-08-01 12:27:00', '2011-08-01 12:27:00', NULL, 0, '8ef61ad7738ac1ec17a490db95747448ad2c9ac9ae167c9534dad884fb15122f')

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(params[:user])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `updated_at` = '2011-08-02 17:22:19', `encrypted_password` = '7bcffe18680a7576e6f2cfd388072f13bc0cc4193f137fda83f6bacf360cd00e' WHERE `users`.`id` = 2

  def destroy
    user = User.find(params[:id])
    if user.admin? && params[:id] == '1'
      flash[:warning] = "You cant delete root admin."
      redirect_to :controller=>"admin", :action => "users_manager", :page => params[:page]
    else
      user.destroy
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
DELETE FROM `users` WHERE `users`.`id` = 2